Revit 2027 API
FabricWireItem.WireLength Property
 Wire length for this wire item
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WireLength { get; set; }
Public Property WireLength As Double
	Get
	Set
public:
property double WireLength {
	double get ();
	void set (double value);
}
member WireLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for length is not a number
ArgumentOutOfRangeException |  When setting this property: The given value for length must be greater than 0 and no more than 30000 feet.
See Also
Reference
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace